taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32F7xx_DFP</name>
  <description>STMicroelectronics STM32F7 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="2.9.0" date="2017-02-07">
      Added device support for subfamilies STM32F7x2, STM32F7x3
      Added Flash Programming Algorithms for:
      - 1M dual Flash
      - NOR Flash for board STM32756G-EVAL.
      Added Flash Programming Algorithms for Flash 1M dual
      Updated Pack to STM32Cube_FW_F7 Firmware Package version V1.6.0
      - added a patch for STM32Cube_FW_F7 to allow compiling with ARM Compiler 6.
      Updated HAL to version V1.2.0
      Updated documentation
      Updated examples
      Updated SVD files
      Added emWin drivers and examples for STM32F769I-Eval and STM32F769I-Discovery
      Updated CMSIS drivers:
      - SPI: corrected DMA transfer.
      - USB Host/Device: HS driver: On-chip PHY powered down if external ULPI PHY is used
    </release>
    <release version="2.8.0" date="2016-11-18">
      Updated to STM32Cube_FW_F7 Firmware Package version V1.5.1
      Updated RTE_Device config file:
      - Added "Not Used" support for SPI MOSI/MISO pins and USART TX/RX pins.
      - Added SDMMC2 and CAN pin configurations
      Updated CMSIS drivers:
      - CAN:
      -- Added CAN3
      -- Corrected clearing of overrun flag in interrupt routine
      - MCI: Added SDMMC2
      - SPI:
      -- Added "Not Used" support for MISO and MOSI pins
      -- Corrected transfer problem, when DMA is used
      - USART:
      -- Changed USART_ISR_LBD (legacy define) to USART_ISR_LBDF
      -- Added "Not Used" support for TX and RX pins
      - USB Device: Corrected resume event signaling
      Added board support for STM32F769I-Discovery and STM32F769I-EVAL boards
      - Middleware example projects
      - Board support drivers
      Updated examples:
      - Updated emWin examples to emWin V5.36f
      - Updated USB Device CDC ACM VirtualCOM examples (corrected initial UART receive size)
    </release>
    <release version="2.7.0" date="2016-06-17">
      Added device support and documentation for subfamily STM32F765.
      Added flash programming algorithm for QuadSPI Flash memory available on STM32 EVAL boards for STM32F77x and STM32F76x subfamilies.
      Corrected FPU capabilities in device description of some devices which support double precision FPU.
      Updated CMSIS drivers:
      - USB Host: Corrected over-current pin configuration
      - USB Device: VBUS detection is selected automatically based on VBUS sensing pin setting (in RTE_Device.h or by STM32CubeMX)
    </release>
    <release version="2.6.0" date="2016-05-25">
      Added device support for subfamilies STM32F777, STM32F778, STM32F779, STM32F767, STM32F768, and STM32F769
      Updated Pack to STM32Cube_FW_F7 Firmware Package version V1.4.0
      Updated HAL to version V1.1.0
      Updated CMSIS drivers:
      - I2C: reflect changes from RTE_Device.h (Ver 1.2.2) adding pin configurations
      - SPI: reflect changes from RTE_Device.h (Ver 1.2.2) adding pin configurations
      - USART: reflect changes from RTE_Device.h (Ver 1.2.2) adding pin configurations
      - USB Device:
      -- Corrected initial resume signaling after USB Bus Reset
      -- Corrected device status information
      - CAN:
      -- Corrected CAN2 initialization was disabling CAN1 filters
      -- Corrected receive overrun signaling
    </release>
    <release version="2.5.0" date="2016-04-14">
      Updated CMSIS drivers:
      - EMAC:
      -- Corrected Ethernet PTP functionality
      - CAN: Corrected functionality when NULL pointer is provided for one or both signal callbacks in Initialize function call
      - USB Host high-speed:
      -- Corrected initialization for full-speed transceiver mode (unexisting OTG_HS_GUSBCFG_PHSEL corrected to OTG_HS_GUSBCFG_PHYSEL)
      -- Added DMA configuration to RTE_Device.h
      -- Corrected wrong result of PipeTransferGetResult for In Pipe transfers in DMA mode
      -- Added check to PipeTransfer function for 4-byte data alignment if DMA is used
      - USART:
      -- Corrected Data Bits format configuration
      -- Corrected CTS handling
      Updated examples:
      - Updated emWin examples to emWin V5.32
      - Updated CAN example
      - Updated USB Host examples
      - Updated USB Device CDC ACM VirtualCOM examples
    </release>
    <release version="2.5.0-dev5">
      Updated documentation.
      Updated Debug Description (STM32F7xx.dbgconf added).
    </release>
    <release version="2.4.0" date="2016-01-27">
      Updated STM32Cube_FW_F7 Firmware Package:
      - updated to version V1.3.0
      - updated HAL to version V1.0.4
      CMSIS Driver:
      - USB Device:
      -- updated Isochronous transfer
      - USB Host:
      -- interrupt priority handling removed from driver
      -- added DMA support to high-speed port driver reducing CPU load (enabled by default)
      -- renamed externally overridable setting for maximum number of pipes used
         from USBH_MAX_PIPE_NUM to USBH0_MAX_PIPE_NUM for full-speed driver, and
         from USBH_MAX_PIPE_NUM to USBH1_MAX_PIPE_NUM for high-speed driver
      -- corrected speed setting for On-chip Full-speed PHY for high-speed port
      - CAN: corrected functionality when only one CAN controller is used
      - SAI: corrected configuration for receive DMA, synchronization and FRC register
      - I2C:
      -- MasterReceive function corrected when receiving without restart condition
      -- corrected ARM_I2C_GetDataCount and ARM_I2C_SignalEvent behavior when stop detected
      - USART: added the clearing of noise detection flag
      Board Support STM32F746G-Discovery and STM32F756G-EVAL:
      - Added Network examples using DualStack (IPv4/IPv6) Middleware (Keil.MDK-Middleware.7.0.0.pack required)
      - Added Audio Board Interfaces
      - Added USB Device Audio examples
    </release>
    <release version="2.3.0" date="2015-10-23">
      MDK-ARM configuration via STM32CubeMX:
      - Updated MX_Device.h generation: pin names characters '/', '-', ' ' converted to '_'
      Added Flash Programming Algorithm for external Flash on 32F746G-DISCOVERY board
      Added CMSIS Driver for CAN
      - Extended RTE_Device.h
      - Added Examples CAN Data and CAN RTR for STMicroelectronics STM32756G-EVAL Board
      Updated CMSIS drivers:
      - all: Corrected PowerControl function for Unconditional Power Off
      - EMAC: Corrected return value of the ReadFrame function
      - I2C: Corrected setting of own address
      - MCI: Removed clock power save bit handling from ARM_MCI_BUS_SPEED control
      - USB Device:  Updated procedure for IN Endpoint FIFO flush
      - USB Host: Corrected multiple packet sending and PING functionality
      - SPI: Corrected 8bit/16bit Data register access, regarding the Data frame size
      - SPI: Corrected pin configuration (for RTE_SPI2_NSS_PIN and MX_SPI3_MOSI_Pin) in SPI_STM32F7xx.h
      Updated emWin GUIDemo examples (added MPU configuration)
    </release>
    <release version="2.2.0" date="2015-09-04">
      Introducing project creation with MDK and STM32Cube (STM32Cube HAL and STM32CubeMX):
      - Added STM32CubeMxLauncher (uVision launcher for STM32CubeMX configuration utility)
      - Added documentation for creating projects with MDK and STM32Cube
      - Added project examples created with MDK and STM32Cube:
      -- Blinky for ST Microelectronics STM32F746G-Discovery
      -- emWin GUI_VNC for ST Microelectronics STM32F746G-Discovery
      - Enhanced CMSIS drivers compatibility with STM32CubeMX
      Updated CMSIS drivers:
      - EMAC: Corrected lockup after long runtime
    </release>
    <release version="2.1.0" date="2015-07-31">
      Added CMSIS-Driver for I2C and SAI
      Updated RTE_Device.h (Ver 1.1.0) adding the SAI driver configurations for SAI1 and SAI2
      Extended File_Demo example (NOR flash drive F0 enabled)
      Extended template file "main.c" with provisions for using CMSIS-RTOS RTX
      Corrected CMSIS Driver USART: The driver incorrectly stopped receiving data when calling the USART_Receive function while the receiver is busy
    </release>
    <release version="2.0.0" date="2015-07-16">
      This PACK requires Keil.MDK-Middleware.6.5.0.pack to be the latest version installed
      Integrates STMicroelectronics STM32CubeF7 Firmware Package V1.1.0
      Added CMSIS-Driver for Ethernet MAC, MCI, SPI, USART, USB Device and USB Host
      Added Board support and MDK-Middleware Examples for ST Microelectronics STM32F746G-Discovery
      - FileSystem, Network, USB Device/Host and emWin
      Added Board support and MDK-Middleware Examples for ST Microelectronics STM32756G-EVAL
      - FileSystem, Network, USB Device/Host and emWin
      Added OTP, OPT Flash Algorithms and templates
      Updated Flash Algorithm
    </release>
    <release version="1.2.0" date="2015-06-26">
      Increased timeout for Sector Erase in Flash Algorithms.
      RAMsize for Flash Algorithm corrected
      Replicated Flash Algorithms for project backward compatibility
    </release>
    <release version="1.1.0" date="2015-06-22">
      Added Flash Algorithm for external flash memory to be used with the STM32756G-EVAL Board
    </release>
    <release version="1.0.0" date="2015-06-12">
      Initial version of STM32F7 Device Family Pack.
      STM32F756, STM32F745, STM32F746 sub families
      - Device description and Startup component
      - Flash Programming Algorithms for Flash and ITCM
      - System View Description file
      - Documentation
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F7</keyword>
    <keyword>STM32F7xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F7 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M7" DcoreVersion="r0p1" Dclock="216000000" Dmpu="MPU" Dendian="Little-endian"/>
      <book name="Documentation/DM00189702.pdf" title="STM32F7xx HAL Drivers"/>
      <book name="Documentation/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>
      <algorithm name="CMSIS/Flash/STM32F7xx_QSPI_Disco.FLM"     start="0x90000000" size="0x01000000" RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F7xx_QSPI_Micron.flm"    start="0x90000000" size="0x04000000" RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F77x_QSPI_Micron.FLM"    start="0x90000000" size="0x04000000" RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F7xx_NOR_Micron.FLM"     start="0x60000000" size="0x01000000" RAMstart="0x20010000" RAMsize="0x2000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F7xx_OPT.FLM"            start="0x1FFF0000" size="0x08"       RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F7xx_OTP.FLM"            start="0x1FF0F000" size="0x0410"     RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F769I_QSPI_Macronix.FLM" start="0x90000000" size="0x04000000" RAMstart="0x20010000" RAMsize="0x1000" default="0"/>
      <algorithm name="CMSIS/Flash/STM32F723E_QSPI_Macronix.FLM" start="0x90000000" size="0x04000000" RAMstart="0x20010000" RAMsize="0x1000" default="0"/>

      <debugvars configfile="Debug/STM32F7xx.dbgconf" version="1.0.0">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
        __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode

        __var ETMTrace_D0    = 1;            // 0 = PC1,  1 = PE3, 2 = PG13
        __var ETMTrace_D1    = 1;            // 0 = PC8,  1 = PE4, 2 = PG14
        __var ETMTrace_D2    = 1;            // 0 = PD2,  1 = PE5
        __var ETMTrace_D3    = 1;            // 0 = PC12, 1 = PE6
      </debugvars>

