taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
        <!-- *************************  Device 'STM32F756ZG'  ***************************** -->
        <device Dname="STM32F756ZG">
          <variant Dvariant="STM32F756ZGYx"> <feature type="CSP" n="143"/> </variant>
          <variant Dvariant="STM32F756ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756VG'  ***************************** -->
        <device Dname="STM32F756VG">
          <variant Dvariant="STM32F756VGHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F756VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756IG'  ***************************** -->
        <device Dname="STM32F756IG">
          <variant Dvariant="STM32F756IGKx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F756IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756BG'  ***************************** -->
        <device Dname="STM32F756BG">
          <variant Dvariant="STM32F756BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F756NG'  ***************************** -->
        <device Dname="STM32F756NG">
          <variant Dvariant="STM32F756NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F765'  **************************** -->
      <subFamily DsubFamily="STM32F765">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x5_v1r1.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F765xx"/>
        <memory id="IRAM1" start="0x20020000" size="0x60000"   init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000"   init="0" default="1" />
        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00273119.pdf" title="STM32F765/767/768A/769 Data Sheet"/>

        <!-- *************************  Device 'STM32F765BG'  ***************************** -->
        <device Dname="STM32F765BG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765BI'  ***************************** -->
        <device Dname="STM32F765BI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765IG'  ***************************** -->
        <device Dname="STM32F765IG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765IGKx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F765IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765II'  ***************************** -->
        <device Dname="STM32F765II">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765IIKx"> <feature type="BGA" n="176"/> </variant>
          <variant Dvariant="STM32F765IITx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765NG'  ***************************** -->
        <device Dname="STM32F765NG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765NI'  ***************************** -->
        <device Dname="STM32F765NI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765VG'  ***************************** -->
        <device Dname="STM32F765VG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
