taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
      <!-- ************************  Subfamily 'STM32F777'  **************************** -->
      <subFamily DsubFamily="STM32F777">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x7_v1r2.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F777xx"/>
        <memory id="IRAM1" start="0x20020000" size="0x60000"   init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000"   init="0" default="1" />
        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00225424.pdf" title="STM32F777/778A/779 Data Sheet"/>

        <!-- *************************  Device 'STM32F777BI'  ***************************** -->
        <device Dname="STM32F777BI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F777BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F777NI'  ***************************** -->
        <device Dname="STM32F777NI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F777NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F777II'  ***************************** -->
        <device Dname="STM32F777II">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F777IITx"> <feature type="QFP" n="176"/> </variant>
           <variant Dvariant="STM32F777IIKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F777ZI'  ***************************** -->
        <device Dname="STM32F777ZI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F777ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F777VI'  ***************************** -->
        <device Dname="STM32F777VI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F777VITx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F778'  **************************** -->
      <subFamily DsubFamily="STM32F778">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x9_v1r2.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F777xx"/>
        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00225424.pdf" title="STM32F777/778A/779 Data Sheet"/>

        <!-- *************************  Device 'STM32F778AI'  ***************************** -->
        <device Dname="STM32F778AI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F778AIYx"> <feature type="CSP" n="180"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F779'  **************************** -->
      <subFamily DsubFamily="STM32F779">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x9_v1r2.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F779xx"/>
        <memory id="IRAM1" start="0x20020000" size="0x60000"   init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000"   init="0" default="1" />
        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00225424.pdf" title="STM32F777/778A/779 Data Sheet"/>

        <!-- *************************  Device 'STM32F779BI'  ***************************** -->
        <device Dname="STM32F779BI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F779BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F779NI'  ***************************** -->
        <device Dname="STM32F779NI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F779NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F779II'  ***************************** -->
        <device Dname="STM32F779II">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F779IITx"> <feature type="QFP" n="176"/> </variant>
        </device>
