taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
        <!-- *************************  Device 'STM32F779AI'  ***************************** -->
        <device Dname="STM32F779AI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F779AIYx"> <feature type="CSP" n="180"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F732'  **************************** -->
      <subFamily DsubFamily="STM32F732">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x2_v1r0.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F732xx"/>
        <memory id="IRAM1" start="0x20000000" size="0x40000"   init="0" default="1" />
        <!--book name="Documentation/?.pdf" title="? Reference Manual"/-->
        <!--book name="Documentation/?.pdf" title="? Data Sheet"/-->

        <!-- *************************  Device 'STM32F732VE'  ***************************** -->
        <device Dname="STM32F732VE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F732VETx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F732RE'  ***************************** -->
        <device Dname="STM32F732RE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F732RETx"> <feature type="QFP" n="64"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F732ZE'  ***************************** -->
        <device Dname="STM32F732ZE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F732ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F732IE'  ***************************** -->
        <device Dname="STM32F732IE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F732IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F732IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F722'  **************************** -->
      <subFamily DsubFamily="STM32F722">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x2_v1r0.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F722xx"/>
        <memory id="IRAM1" start="0x20000000" size="0x40000"   init="0" default="1" />
        <!--book name="Documentation/?.pdf" title="? Reference Manual"/-->
        <!--book name="Documentation/?.pdf" title="? Data Sheet"/-->
        
        <!-- *************************  Device 'STM32F722VE'  ***************************** -->
        <device Dname="STM32F722VE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722VETx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F722RE'  ***************************** -->
        <device Dname="STM32F722RE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722RETx"> <feature type="QFP" n="64"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F722ZE'  ***************************** -->
        <device Dname="STM32F722ZE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F722IE'  ***************************** -->
        <device Dname="STM32F722IE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F722IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F722RC'  ***************************** -->
        <device Dname="STM32F722RC">
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x40000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>
