taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
        <!-- *************************  Device 'STM32F722VC'  ***************************** -->
        <device Dname="STM32F722VC">
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x40000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722VCTx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F722ZC'  ***************************** -->
        <device Dname="STM32F722ZC">
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x40000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722ZCTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F722IC'  ***************************** -->
        <device Dname="STM32F722IC">
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x40000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F722ICTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F722ICKx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F733'  **************************** -->
      <subFamily DsubFamily="STM32F733">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x3_v1r0.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F733xx"/>
        <memory id="IRAM1" start="0x20000000" size="0x40000"   init="0" default="1" />
        <!--book name="Documentation/?.pdf" title="? Reference Manual"/-->
        <!--book name="Documentation/?.pdf" title="? Data Sheet"/-->
        
        <!-- *************************  Device 'STM32F733VE'  ***************************** -->
        <device Dname="STM32F733VE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F733VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F733VEYx"> <feature type="CSP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F733ZE'  ***************************** -->
        <device Dname="STM32F733ZE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F733ZETx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F733ZEKx"> <feature type="BGA" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F733IE'  ***************************** -->
        <device Dname="STM32F733IE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F733IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F733IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F723'  **************************** -->
      <subFamily DsubFamily="STM32F723">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x3_v1r0.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F723xx"/>
        <memory id="IRAM1" start="0x20000000" size="0x40000"   init="0" default="1" />
        <!--book name="Documentation/?.pdf" title="? Reference Manual"/-->
        <!--book name="Documentation/?.pdf" title="? Data Sheet"/-->

        <!-- *************************  Device 'STM32F723VE'  ***************************** -->
        <device Dname="STM32F723VE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F723VEYx"> <feature type="CSP" n="100"/> </variant>
        </device>
