taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
        <!-- *************************  Device 'STM32F723ZE'  ***************************** -->
        <device Dname="STM32F723ZE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F723ZETx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F723ZEKx"> <feature type="BGA" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F723IE'  ***************************** -->
        <device Dname="STM32F723IE">
          <memory id="IROM1" start="0x08000000" size="0x80000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x80000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F723IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F723IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F723ZC'  ***************************** -->
        <device Dname="STM32F723ZC">
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x40000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F723ZCTx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F723ZCKx"> <feature type="BGA" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F723IC'  ***************************** -->
        <device Dname="STM32F723IC">
          <memory id="IROM1" start="0x08000000" size="0x40000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x40000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_512_TCM.FLM" start="0x00200000" size="0x40000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F723ICTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F723ICKx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <condition id="CM7_LE_ARMCC">
      <description>Cortex-M7 processor based device in little endian mode for the ARM Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7F_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the ARM Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7F_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7F_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F7">
      <description>STMicroelectronics STM32F7 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F7*"/>
    </condition>

    <condition id="STM32F745">
      <description>STMicroelectronics STM32F745 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F745*"/>
    </condition>
    <condition id="STM32F746">
      <description>STMicroelectronics STM32F746 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F746*"/>
    </condition>
    <condition id="STM32F756">
      <description>STMicroelectronics STM32F756 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F756*"/>
    </condition>
    <condition id="STM32F765">
      <description>STMicroelectronics STM32F765 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F765*"/>
    </condition>
    <condition id="STM32F767">
      <description>STMicroelectronics STM32F767 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F767*"/>
    </condition>
    <condition id="STM32F768">
      <description>STMicroelectronics STM32F768 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F768*"/>
    </condition>
    <condition id="STM32F769">
      <description>STMicroelectronics STM32F769 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F769*"/>
    </condition>
    <condition id="STM32F777">
      <description>STMicroelectronics STM32F777 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F777*"/>
    </condition>
    <condition id="STM32F778">
      <description>STMicroelectronics STM32F778 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F778*"/>
    </condition>
