taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
    <condition id="STM32F779">
      <description>STMicroelectronics STM32F779 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F779*"/>
    </condition>
    <condition id="STM32F722">
      <description>STMicroelectronics STM32F722 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F722*"/>
    </condition>
    <condition id="STM32F723">
      <description>STMicroelectronics STM32F723 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F723*"/>
    </condition>
    <condition id="STM32F732">
      <description>STMicroelectronics STM32F732 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F732*"/>
    </condition>
    <condition id="STM32F733">
      <description>STMicroelectronics STM32F733 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F733*"/>
    </condition>



    <condition id="STM32F7x6">
      <description>STMicroelectronics STM32F746/756 Series devices</description>
      <accept  condition="STM32F746"/>
      <accept  condition="STM32F756"/>
    </condition>
    <condition id="STM32F7x6_7x7_7x8_7x9">
      <description>STMicroelectronics STM32F746/756/767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F746"/>
      <accept  condition="STM32F756"/>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F76x_77x">
      <description>STMicroelectronics STM32F765/767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F765"/>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F7x8">
      <description>STMicroelectronics STM32F768/778 Series devices</description>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F778"/>
    </condition>
    <condition id="STM32F7x9">
      <description>STMicroelectronics STM32F769/779 Series devices</description>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F7x8_7x9">
      <description>STMicroelectronics STM32F7x8/7x9 Series devices</description>
      <accept  condition="STM32F7x8"/>
      <accept  condition="STM32F7x9"/>
    </condition>
    <condition id="STM32F756_777_779">
      <description>STMicroelectronics STM32F756/777/779 Series devices</description>
      <accept  condition="STM32F756"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F7x7_7x8_7x9">
      <description>STMicroelectronics STM32F767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>

    <condition id="STM32F7_ARMCC">
      <description>filter for STM32F7xx devices and the ARM compiler</description>
      <require condition="STM32F7"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F745_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F746_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F756_ARMCC">
      <description>filter for STM32F756 devices and the ARM compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F765_ARMCC">
      <description>filter for STM32F765 devices and the ARM compiler</description>
      <require condition="STM32F765"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F767_ARMCC">
      <description>filter for STM32F767 devices and the ARM compiler</description>
      <require condition="STM32F767"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F768_ARMCC">
      <description>filter for STM32F768 devices and the ARM compiler</description>
      <require condition="STM32F768"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F769_ARMCC">
      <description>filter for STM32F769 devices and the ARM compiler</description>
      <require condition="STM32F769"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F777_ARMCC">
      <description>filter for STM32F777 devices and the ARM compiler</description>
      <require condition="STM32F777"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F778_ARMCC">
      <description>filter for STM32F778 devices and the ARM compiler</description>
      <require condition="STM32F778"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F779_ARMCC">
      <description>filter for STM32F779 devices and the ARM compiler</description>
      <require condition="STM32F779"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F722_ARMCC">
      <description>filter for STM32F722 devices and the ARM compiler</description>
      <require condition="STM32F722"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F723_ARMCC">
      <description>filter for STM32F723 devices and the ARM compiler</description>
      <require condition="STM32F723"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F732_ARMCC">
      <description>filter for STM32F732 devices and the ARM compiler</description>
      <require condition="STM32F732"/>
      <require Tcompiler="ARMCC"/>
    </condition>
