taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F7xx_DFP.2.9.0.pdsc
    <condition id="STM32F733_ARMCC">
      <description>filter for STM32F733 devices and the ARM compiler</description>
      <require condition="STM32F733"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F745_GCC">
      <description>filter for STM32F745 devices and the GCC compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F746_GCC">
      <description>filter for STM32F746 devices and the GCC compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F756_GCC">
      <description>filter for STM32F756 devices and the GCC compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F765_GCC">
      <description>filter for STM32F765 devices and the GCC compiler</description>
      <require condition="STM32F765"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F767_GCC">
      <description>filter for STM32F767 devices and the GCC compiler</description>
      <require condition="STM32F767"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F768_GCC">
      <description>filter for STM32F768 devices and the GCC compiler</description>
      <require condition="STM32F768"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F769_GCC">
      <description>filter for STM32F769 devices and the GCC compiler</description>
      <require condition="STM32F769"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F777_GCC">
      <description>filter for STM32F777 devices and the GCC compiler</description>
      <require condition="STM32F777"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F778_GCC">
      <description>filter for STM32F778 devices and the GCC compiler</description>
      <require condition="STM32F778"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F779_GCC">
      <description>filter for STM32F779 devices and the GCC compiler</description>
      <require condition="STM32F779"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F722_GCC">
      <description>filter for STM32F722 devices and the GCC compiler</description>
      <require condition="STM32F722"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F723_GCC">
      <description>filter for STM32F723 devices and the GCC compiler</description>
      <require condition="STM32F723"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F732_GCC">
      <description>filter for STM32F732 devices and the GCC compiler</description>
      <require condition="STM32F732"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F733_GCC">
      <description>filter for STM32F733 devices and the GCC compiler</description>
      <require condition="STM32F733"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="STM32F745_IAR">
      <description>filter for STM32F745 devices and the IAR compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F746_IAR">
      <description>filter for STM32F746 devices and the IAR compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F756_IAR">
      <description>filter for STM32F756 devices and the IAR compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F765_IAR">
      <description>filter for STM32F765 devices and the IAR compiler</description>
      <require condition="STM32F765"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F767_IAR">
      <description>filter for STM32F767 devices and the IAR compiler</description>
      <require condition="STM32F767"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F768_IAR">
      <description>filter for STM32F768 devices and the IAR compiler</description>
      <require condition="STM32F768"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F769_IAR">
      <description>filter for STM32F769 devices and the IAR compiler</description>
      <require condition="STM32F769"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F777_IAR">
      <description>filter for STM32F777 devices and the IAR compiler</description>
      <require condition="STM32F777"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F778_IAR">
      <description>filter for STM32F778 devices and the IAR compiler</description>
      <require condition="STM32F778"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F779_IAR">
      <description>filter for STM32F779 devices and the IAR compiler</description>
      <require condition="STM32F779"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F722_IAR">
      <description>filter for STM32F722 devices and the IAR compiler</description>
      <require condition="STM32F722"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F723_IAR">
      <description>filter for STM32F723 devices and the IAR compiler</description>
      <require condition="STM32F723"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F732_IAR">
      <description>filter for STM32F732 devices and the IAR compiler</description>
      <require condition="STM32F732"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32F733_IAR">
      <description>filter for STM32F733 devices and the IAR compiler</description>
      <require condition="STM32F733"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F7 CMSIS">
      <description>STMicroelectronics STM32F7 Device and CMSIS-CORE</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

